Revit 2024 API
FamilySizeTableManager Class
 Manages importing, exporting, and querying size data through the FamilySizeTable class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class FamilySizeTableManager : IDisposable
Visual Basic
Public Class FamilySizeTableManager _
	Implements IDisposable
Visual C++
public ref class FamilySizeTableManager : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FamilySizeTableManager
See Also
FamilySizeTableManager Members
Autodesk.Revit.DB Namespace